{
    "home": {
        "title": {
            "EN": "home",
            "VN": "trang chủ"
        }
    },
    "aboutMe": {
        "title": {
            "EN": "About Me",
            "VN": "Giới Thiệu"
        },
        "desc": {
            "title": {
                "EN": "summary",
                "VN": "tổng quát"
            },
            "status": {
                "EN": "looking for work",
                "VN": "đang tìm việc"
            },
            "greeting": {
                "EN": "hi. i'm",
                "VN": "xin chào, tôi là"
            },
            "myName": {
                "EN": "ho thai khanh",
                "VN": "hồ thái khanh"
            },
            "jobTitle": [
                "frontend",
                "developer"
            ],
            "content": {
                "EN": "Passionate about programming and enjoy problem-solving. Have over 4 years of experience in developing, delivering product while working, collaborating in a team. Open-minded and ready to adapt to new technologies while self-motivated and determined to deliver the product at the highest quality with great attention to detail and within the desired time limit",
                "VN": "Là một người đam mê lập trình và yêu thích giải quyết vấn đề. Với hơn 4 năm kinh nghiệm trong việc sản xuất, phát triển sản phẩm và làm việc, phối hợp trong một nhóm. Cởi mở và sẵn sàng học học hỏi các công nghệ mới, đồng thời chủ động và quyết tâm để có thể bàn giao với sẩn phẩm với sự tỉ mỉ và chất lượng tốt nhất trong khoảng thời gian đã định trước"
            }
        },
        "downloadBtn": {
            "EN": "download resume",
            "VN": "tải xuống Resume"
        },
        "skills": {
            "title": {
                "EN": "skills",
                "VN": "công nghệ"
            }
        },
        "relatedSkills": {
            "title": {
                "EN": "related skills",
                "VN": "kỹ năng khác"
            },
            "list": [
                {
                    "name": "EN",
                    "title": {
                        "EN": "English",
                        "VN": "tiếng anh"
                    },
                    "content": {
                        "EN": [
                            "985 Toeic score",
                            "Strong Comminication skills",
                            "Proficient at reading technical documents",
                            "Capable of translating documents from English to vietnamese"
                        ],
                        "VN": [
                            "Chứng chỉ Toeic 985",
                            "Giao tiếp thành thạo",
                            "Dễ dàng đọc hiểu tài liệu",
                            "Có kinh nghiệm biên dịch tài liệu từ tiếng Anh sang tiếng Việt"
                        ]
                    }
                },
                {
                    "name": "GD",
                    "title": {
                        "EN": "graphic design",
                        "VN": "thiết kế đồ họa"
                    },
                    "content": {
                        "EN": [
                            "Experienced with making 2D vector based graphics",
                            "Proficient at Powerpoint and Illustrator"
                        ],
                        "VN": [
                            "Thiết kế ấn phẩm, đồ họa 2D",
                            "Thành thạo Powerpoint, Illustrator"
                        ]
                    }
                },
                {
                    "name": "VE",
                    "title": {
                        "EN": "video editing",
                        "VN": "chỉnh sửa video"
                    },
                    "content": {
                        "EN": [
                            "Proficient with After Effects, Premiere ",
                            "Experienced with video editing",
                            "Capable of making short 2D animations, motion graphics"
                        ],
                        "VN": [
                            "Thành thạo với After Effects, Premiere",
                            "Có kinh nghiệm chỉnh sửa, edit video",
                            "Có thể tạo, dựng video với animation 2D ngắn"
                        ]
                    }
                }
            ]
        }
    },
    "workHistory": {
        "title": {
            "EN": "Experience",
            "VN": "Kinh Nghiệm"
        },
        "list": [
            {
                "id": "des",
                "companyName": "digital education solution",
                "startYear": 2018,
                "endYear": 2021,
                "jobTitle": "Instructional Designer",
                "duties": {
                    "title": {
                        "EN": "key responsibilities",
                        "VN": "công việc chính"
                    },
                    "content": {
                        "EN": [
                            "Create interactive E-Learning courses that enhance the learner's retention and transfer of information",
                            "Design instructional graphics and user interfaces that simplify complex concepts for learners to understand more easily",
                            "Create games and activities to increase the learner's engagement",
                            "Translate educational materials from English to Vietnamese while preserving the source materials' content",
                            "Decide on the criteria used to judge learner’s completion of the course and their knowledge retention"
                        ],
                        "VN": [
                            "Tạo các khóa học E-Learning giúp người học cải thiện khả năng tiếp thu và lưu giữ kiến thức",
                            "Thiết kế hình ảnh, đồ họa, biểu đồ giúp người học dễ dàng hình dung các khái niệm phức tạp",
                            "Phát triển các hình thức gamification, các hoạt động giải trí nhằm thu hút sự chú ý của người học",
                            "Biên dịch các tài liệu khóa học từ tiếng Anh sang tiếng Việt với mục đích bảo toàn các kiến thức quan trọng",
                            "Xác định các tiêu chí đánh rằng học viên đã hoàn thành khóa học và khả năng lưu giữ kiến thức của họ"
                        ]
                    }
                },
                "achievement": {
                    "title": {
                        "EN": "key achivement",
                        "VN": "thành tựu nổi bật"
                    },
                    "content": {
                        "EN": [
                            "Learned new skills and softwares required for the job",
                            "Presented inventive methods on how to approach difficult tasks",
                            "Consistently delivered working solutions for problems",
                            "Recruited and lead a team of Freelancers to work on a project"
                        ],
                        "VN": [
                            "Học được nhiều công cụ và phần mềm cần thiết cho công việc",
                            "Đề xuất nhiều phương pháp giải quyết vấn đề cho doanh nghiệp",
                            "Liên tục triển khai thành công các công việc được giao",
                            "Tuyển và dẫn dắt đội Freelancers cho dự án"
                        ]
                    }
                },
                "contact": {}
            },
            {
                "id": "vss",
                "companyName": "viettel software services",
                "startYear": 2021,
                "endYear": 2023,
                "jobTitle": "Instructional Designer",
                "duties": {
                    "title": {
                        "EN": "key responsibilities",
                        "VN": "công việc chính"
                    },
                    "content": {
                        "EN": [
                            "Create E-Learning courses and design professional slides for internal usage: onboarding, training, product presentation, reporting...",
                            "Design promotional graphics for events and training programs: posters, banners, backdrops, promotional videos",
                            "Research new ways to implement gamification for existing E-Learning courses",
                            "Translate E-learning courses from English to Vietnamese while making necessary adjustments to meet the company's needs",
                            "Organize activities for employees to encourage learning in the workplace"
                        ],
                        "VN": [
                            "Sản xuất các khóa học E-learning, thiết kế các slide thuyết trình chuyên nghiệp dành cho các sự kiện như onboarding, đào tạo nhân viên, giới thiệu sản phẩm, báo cáo của nội bộ công ty",
                            "Thiết kế các ấn phẩm đồ họa dành cho các sự kiện và chương trình đào tạo như thiết kế poster, banner, backdrop, video truyền thông... ",
                            "Nghiên cứu các giải pháp để áp dụng các hình thức gamification vào các khóa học hiện có",
                            "Biên dịch nội dung các khóa học E-Learning từ tiếng Anh sang tiếng Việt và có các điều chỉnh nhằm đáp ứng nhu cầu của tổ chức",
                            "Tổ chức các hoạt động nhằm khuyến khích tinh thần học hỏi tại nơi làm việc"
                        ]
                    }
                },
                "achievement": {
                    "title": {
                        "EN": "key achivement",
                        "VN": "thành tựu nổi bật"
                    },
                    "content": {
                        "EN": [
                            "Created many innovative learning courses for the organization",
                            "Completed difficult tasks that required the learning of new technologies, skills",
                            "Collaborated within a team to effectively coordinate events, projects, and training programs, resulting in the many awards and accolades"
                        ],
                        "VN": [
                            "Mang lại nhiều cải tiến cho thư viện bài giảng của tổ chức",
                            "Hoàn thành nhiều công việc cần yêu cầu sử dụng các công nghệ, kỹ năng mới",
                            "Phối hợp thực hiện với các thành viên trong team để tổ chức các sự kiện, dự án, chương trình đào tạo, đạt được nhiều thành tựu đã được công nhận"
                        ]
                    }
                },
                "contact": {
                    "title": {
                        "EN": "contact",
                        "VN": "liên hệ"
                    },
                    "name": {
                        "EN": "Nguyễn Thanh Hải",
                        "VN": "Nguyễn Thanh Hải"
                    },
                    "jobTitle": {
                        "EN": "Direct manager",
                        "VN": "Quản lý trực tiếp"
                    },
                    "mail": ""
                }
            }
        ]
    },
    "projectPages": {
        "title": {
            "EN": "My Projects",
            "VN": "Dự án của tôi"
        },
        "projects": [
            {
                "title": {
                    "EN": "Project #1",
                    "VN": "Dự án #1"
                },
                "projectName": "Youtracker",
                "desc": {
                    "EN": "An app for browsing and managing your and other people's YouTube playlists. Created using React, Tailwind, and Express, Youtracker uses OAuth 2.0 to request access to the user's account and YouTube public API to access the user's playlist data. The core functionalities are:\n\n- Browsing YouTube channel using URL, handle name or channel ID\n- Login to your channel with Google's Authorization\n- Create, View, Update, Delete playlists on your channel\n- Create, View, Update, Delete videos in your playlist\n - Save a record of your current playlist or download the video to your local PC  ",
                    "VN": "Ứng dụng dành cho việc theo dõi các playlist trên Youtube và tự quản lý playlist của cá nhân. Được phát triển với React, Tailwind và Express, Youtracker sử dụng OAuth 2.0 để yêu cầu quyền truy vào tài khoản YouTube sau đó sử dụng API của Youtube để thực hiện các thao tác quản lý dữ liệu playlist cá nhân. Các chức năng chính bao gồm:\n\n- Tra cứu các kênh YouTube với URL, tên handle hoặc Id của kênh\n- Cấp quyền truy cập vào dữ liệu qua dịch vụ Authorization của Google\n - Tạo, xem, thay đổi, xóa dữ liệu playlist của kênh YouTube cá nhân\n- Tạo, xem, thay đổi, xóa dữ liệu video của playlist cá nhân\n - Lưu dữ liệu hiện tại của playlist và tải xuống trực tiếp video"
                },
                "techStack": {
                    "title": {
                        "EN": "tech stack",
                        "VN": "tech stack"
                    },
                    "list": [
                        "ReactJs",
                        "Tailwind",
                        "Vite",
                        "Express",
                        "Figma",
                        "Git"
                    ]
                },
                "imageUrl": "./src/assets/img/youtracker-screenshot.jpg",
                "icon": "/src/assets/icons/app_icons/youtracker.svg",
                "liveViewUrl": "https://server-blue-wildflower-4967.fly.dev",
                "gitHubUrl": "https://github.com/hothaikhanh/you-tracker"
            },
            {
                "title": {
                    "EN": "Project #2",
                    "VN": "Dự án #2"
                },
                "projectName": "Tic Tac Toe",
                "desc": {
                    "EN": "A simple Tic Tac Toe game built with vanilla Javascript, HTML, and CSS. The game comes with functionalities such as:\n\n - Multiplayer mode:\n play against a friend and see who can win in a best of 5 format\n\n - Singlerplayer mode:\n play against a bot that is programmed to prevent the player from winning\n\n - Player customizations:\n Players can select their name and icon when they play\n\n",
                    "VN": "Game X/O đơn giản được phát triển với JS, HTML, CSS cơ bản. Các chức năng chính bao gồm:\n\n- Chế độ chơi 2 người:\nChơi cùng một người bạn dưới hình thức BO5\n\n- Chế độ chơi với máy:\nChơi với máy đã được lập trình để ngăn người chơi dành chiến thắng\n\n - Điều chỉnh giao diện:\nNgười chơi có thể thay đổi tên hiển thị và icon hiển thị"
                },
                "techStack": {
                    "title": {
                        "EN": "tech stack",
                        "VN": "tech stack"
                    },
                    "list": [
                        "Html",
                        "CSS",
                        "Javascript",
                        "SASS"
                    ]
                },
                "imageUrl": "./src/assets/img/tictactoe-screenshot.jpg",
                "icon": "/src/assets/icons/app_icons/tictactoe.svg",
                "liveViewUrl": "https://hothaikhanh-tic-tac-toe-app.fly.dev",
                "gitHubUrl": "https://github.com/hothaikhanh/tic-tac-toe"
            },
            {
                "title": {
                    "EN": "Project #3",
                    "VN": "Dự án #3"
                },
                "projectName": "Portfolio",
                "desc": {
                    "EN": "A 3D portfolio page used for displaying my personal information and projects. Built using React, Sass, and ThreeJS (React Three Fiber), the core functionalities include:\n\n - Full 3D environment with camera movements and flexible spotlights \n - Navigation features like navigation bar, scroll, click\n - Option to download a PDF file of my resume\n - Functional language switcher\n - Direct links to my projects\n ",
                    "VN": "Trang portfolio 3D dành cho việc hiển thị thông tin cá nhân và các dự án đã làm. Được phát triển bằng React, Sass và ThreeJs (React Three Fiber), các chức năng nổi bật gồm:\n\n - Môi trường 3D với nhiều chuyển động camera và ánh đèn linh hoạt\n - Các chức năng điều hướng như: thanh navbar, cuộn chuột, click vào màn hình\n - Download bản PDF của Resume về máy\n - Lựa chọn thay đổi ngôn ngữ\n - Đường link truy cập đến trang dự án cá nhân"
                },
                "techStack": {
                    "title": {
                        "EN": "tech stack",
                        "VN": "tech stack"
                    },
                    "list": [
                        "ReactJs",
                        "SASS",
                        "Vite",
                        "Express",
                        "Git",
                        "ThreeJs"
                    ]
                },
                "imageUrl": "./src/assets/img/profo-screenshot.png",
                "icon": "/src/assets/icons/app_icons/profo.svg",
                "liveViewUrl": null,
                "gitHubUrl": "https://github.com/hothaikhanh/Profo"
            }
        ]
    },
    "contact": {
        "title": {
            "EN": "Contact",
            "VN": "Liên lạc"
        },
        "header": {
            "EN": "my contacts",
            "VN": "thông tin liên lạc"
        },
        "email": "hothaikhanh@gmail.com",
        "message": {
            "EN": "Thank you for visiting. Feel free to provide me with any questions or feedback, and please don't hesitate to reach out. I look forward to connecting with you and hope one day I can add great value to your organization.",
            "VN": "Cảm ơn bạn đã ghé qua trang web này, xin vui lòng để lại các câu hỏi hoặc nhận xét, nếu có. Ý kiến của bạn rất quan trọng đối với tôi và tôi hi vọng một ngày có thể mang lại nhiều giá trị cho tổ chức của bạn."
        },
        "actionBtn": {
            "EN": "leave a message",
            "VN": "để lại lời nhắn"
        },
        "contactForm": {
            "email": {
                "EN": "From",
                "VN": "Từ"
            },
            "subject": {
                "EN": "Subject",
                "VN": "Tiêu đề"
            },
            "body": {
                "EN": "Body",
                "VN": "Nội dung"
            },
            "sendBtn": {
                "EN": "Send",
                "VN": "Gửi"
            },
            "message": {
                "success": {
                    "EN": "Email has been sent!",
                    "VN": "Email đã được gửi!"
                },
                "error": {
                    "EN": "An error has occur, please try again later",
                    "VN": "Đã xảy ra lỗi, mời bạn thử lại sau"
                }
            },
            "alert": {
                "email": {
                    "EN": "Please enter a valid email",
                    "VN": "Vui lòng nhập một email hợp lệ"
                },
                "subject": {
                    "EN": "Please enter a subject",
                    "VN": "vui lòng nhập tiêu đề"
                },
                "body": {
                    "EN": "Please enter a message",
                    "VN": "Vui lòng nhập lời nhắn"
                }
            }
        }
    },
    "setting": {
        "title": {
            "EN": "Setting",
            "VN": "Cài đặt"
        },
        "options": [
            {
                "title": {
                    "EN": "language",
                    "VN": "ngôn ngữ"
                },
                "values": [
                    {
                        "key": "EN",
                        "value": "English"
                    },
                    {
                        "key": "VN",
                        "value": "Tiếng Việt"
                    }
                ]
            }
        ]
    },
    "blank": {
        "message": {
            "EN": "no signal",
            "VN": "không tín hiệu"
        }
    },
    "skills": {
        "path": "./src/assets/icons/tech_logos/",
        "list": [
            {
                "name": "Javascript",
                "icon": "js.svg"
            },
            {
                "name": "ReactJs",
                "icon": "reactjs.svg"
            },
            {
                "name": "NodeJs",
                "icon": "nodejs.svg"
            },
            {
                "name": "Vite",
                "icon": "vite.svg"
            },
            {
                "name": "Express",
                "icon": "express.svg"
            },
            {
                "name": "AngularJs",
                "icon": "angular.svg"
            },
            {
                "name": "Tailwind",
                "icon": "tailwind.svg"
            },
            {
                "name": "Git",
                "icon": "git.svg"
            },
            {
                "name": "ThreeJs",
                "icon": "threejs.svg"
            },
            {
                "name": "Html",
                "icon": "html.svg"
            },
            {
                "name": "CSS",
                "icon": "css.svg"
            },
            {
                "name": "SASS",
                "icon": "sass.svg"
            },
            {
                "name": "Figma",
                "icon": "figma.svg"
            }
        ]
    }
}